# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FolderItemInfo..::..Name Property
FolderItemInfo Class See Also
---
The folder name
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace